# Part 1

<center>
<img src="../../img/ods_stickers.jpg">
    
## [mlcourse.ai](https://mlcourse.ai) - Open Machine Learning Course

Author: [Yury Kashnitsky](https://www.linkedin.com/in/festline/). Translated and edited by [Sergey Isaev](https://www.linkedin.com/in/isvforall/), [Artem Trunov](https://www.linkedin.com/in/datamove/), [Anastasia Manokhina](https://www.linkedin.com/in/anastasiamanokhina/), and [Yuanyuan Pao](https://www.linkedin.com/in/yuanyuanpao/). All content is distributed under the [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/) license.

# <center> Assignment #1 (demo)
## <center>  Exploratory data analysis with Pandas


**Same assignment as a [Kaggle Kernel](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset) + [solution](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset-solution).**

**In this task you should use Pandas to answer a few questions about the [Adult](https://archive.ics.uci.edu/ml/datasets/Adult) dataset. (You don't have to download the data â€“ it's already  in the repository). Choose the answers in the [web-form](https://docs.google.com/forms/d/1uY7MpI2trKx6FLWZte0uVh3ULV4Cm_tDud0VDFGCOKg).**

Unique values of all features (for more information, please see the links above):
- `age`: continuous.
- `workclass`: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
- `fnlwgt`: continuous.
- `education`: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
- `education-num`: continuous.
- `marital-status`: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
- `occupation`: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
- `relationship`: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
- `race`: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
- `sex`: Female, Male.
- `capital-gain`: continuous.
- `capital-loss`: continuous.
- `hours-per-week`: continuous.
- `native-country`: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.   
- `salary`: >50K,<=50K

In [1]:
import numpy as np
import pandas as pd
pd.set_option('display.max.columns', 100)
# to draw pictures in jupyter notebook
%matplotlib inline 
import matplotlib.pyplot as plt
import seaborn as sns
# we don't like warnings
# you can comment the following 2 lines if you'd like to
import warnings
warnings.filterwarnings('ignore')

In [7]:
data = pd.read_csv('adult.data',header=None,names=['age',
'workclass',
'fnlwgt',
'education',
'education-num',
'marital-status',
'occupation',
'relationship',
'race',
'sex',
'capital-gain',
'capital-loss',
'hours-per-week',
'native-country',
'salary'])
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

**1. How many men and women (*sex* feature) are represented in this dataset?**

In [13]:
data.groupby('sex').count().reset_index()[['sex','age']]

       sex    age
0   Female  10771
1     Male  21790

**2. What is the average age (*age* feature) of women?**

In [27]:
data[data['sex'] == ' Female']['age'].mean()

36.85823043357163

**3. What is the percentage of German citizens (*native-country* feature)?**

In [36]:
(data[data['native-country'] == ' Germany'].shape[0] / data.shape[0]) * 100

0.42074874850281013

**4-5. What are the mean and standard deviation of age for those who earn more than 50K per year (*salary* feature) and those who earn less than 50K per year?**

In [40]:
data[data['salary'] == ' <=50K']['age'].mean()

36.78373786407767

In [41]:
data[data['salary'] == ' >50K']['age'].mean()

44.24984058155847

In [42]:
data[data['salary'] == ' <=50K']['age'].std()

14.020088490824813

In [43]:
data[data['salary'] == ' >50K']['age'].std()

10.51902771985177

**6. Is it true that people who earn more than 50K have at least high school education? (*education â€“ Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* or *Doctorate* feature)**

In [85]:
# You code here
education_data = data[data['salary'] == ' >50K'].groupby('education').count().reset_index()[['education','age']]
educated_people = education_data[education_data['education'].isin([' Bachelors', ' Prof-school', ' Assoc-acdm', 
                                                 ' Assoc-voc', ' Masters',' Doctorate'])]['age'].sum()

In [88]:
educated_percent = (educated_people/data[data['salary'] == ' >50K'].shape[0]) * 100

In [89]:
if educated_percent > 50:
    print(True)
else:
    print(False)

True

**7. Display age statistics for each race (*race* feature) and each gender (*sex* feature). Use *groupby()* and *describe()*. Find the maximum age of men of *Amer-Indian-Eskimo* race.**

In [50]:
# You code here
data.groupby('sex')['age'].describe().reset_index()

       sex    count       mean        std   min   25%   50%   75%   max
0   Female  10771.0  36.858230  14.013697  17.0  25.0  35.0  46.0  90.0
1     Male  21790.0  39.433547  13.370630  17.0  29.0  38.0  48.0  90.0

In [51]:
data.groupby('race')['age'].describe().reset_index()

,race,count,mean,std,min,25%,50%,75%,max
0,Amer-Indian-Eskimo,311.0,37.173633,12.447130,17.0,28.0,35.0,45.5,82.0
1,Asian-Pac-Islander,1039.0,37.746872,12.825133,17.0,28.0,36.0,45.0,90.0
2,Black,3124.0,37.767926,12.759290,17.0,28.0,36.0,46.0,90.0
3,Other,271.0,33.457565,11.538865,17.0,25.0,31.0,41.0,77.0
4,White,27816.0,38.769881,13.782306,17.0,28.0,37.0,48.0,90.0

In [55]:
descride_data = data.groupby('race')['age'].describe().reset_index()
descride_data[descride_data['race'] == ' Amer-Indian-Eskimo']['max']

0    82.0
Name: max, dtype: float64

In [53]:
data[data['race'] == ' Amer-Indian-Eskimo']['age'].max()

82

**8. Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (*marital-status* feature)? Consider as married those who have a *marital-status* starting with *Married* (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.**

In [97]:
# You code here
marital_status_data = data[data['salary'] == ' >50K'].groupby('marital-status').count().reset_index()[['marital-status','age']]
marital_status_data

           marital-status   age
0                Divorced   463
1       Married-AF-spouse    10
2      Married-civ-spouse  6692
3   Married-spouse-absent    34
4           Never-married   491
5               Separated    66
6                 Widowed    85

In [104]:
married = marital_status_data[marital_status_data['marital-status'].str.startswith(' Married')].sum()[1]

In [105]:
single = marital_status_data[~(marital_status_data['marital-status'].str.startswith(' Married'))].sum()[1]

In [106]:
if married > single:
    print('married')
else:
    print('single')

married

**9. What is the maximum number of hours a person works per week (*hours-per-week* feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?**

In [58]:
max_hours_per_week = data['hours-per-week'].max()
max_hours_per_week

99

In [65]:
people_who_work_max_hours_per_week = data[data['hours-per-week'] == max_hours_per_week].shape[0]
people_who_work_max_hours_per_week

85

In [68]:
salary_df = data[data['hours-per-week'] == max_hours_per_week].groupby('salary').count().reset_index()[['salary', 'age']]
salary_df['percent'] = (salary_df['age'] / people_who_work_max_hours_per_week) * 100
salary_df[salary_df['salary'] == ' >50K']['percent']

1    29.411765
Name: percent, dtype: float64

**10. Count the average time of work (*hours-per-week*) for those who earn a little and a lot (*salary*) for each country (*native-country*). What will these be for Japan?**

In [74]:
# You code here
salary_hours_data = data.groupby(['native-country','salary'])['hours-per-week']\
.describe().reset_index()[['salary','native-country','mean']]

salary_hours_data[salary_hours_data['native-country'] == ' Japan']

    salary native-country       mean
47   <=50K          Japan  41.000000
48    >50K          Japan  47.958333

# Part 2